OpenQBMM_2.0.0/tutorials/buoyantPbePimpleFoam/TaylorCouette/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }
    
    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1.0e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 20;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   1.0e5;
    turbOnFinalIterOnly no;
    
    residualControl
    {
        p_rgh           
        {
            tolerance   1e-3;
            relTol      0.01;
        }
        
        h
        {
            tolerance   1e-3;
            relTol      0.1;
        }
        
        T
        {
            tolerance   1e-3;
            relTol      0.1;
        }

        "R.*" 
        {
            tolerance   1e-3;
            relTol      0.1;
        }
    }
}

relaxationFactors
{
    equations
    {
        U               0.9;
        k               0.7;
        epsilon         0.7;
        R               0.7;
    }
}


// ************************************************************************* //
